## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] has changed
  ~ resource "azurerm_storage_account" "logs" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Storage/storageAccounts/findatppr353logs"
        name                              = "findatppr353logs"
        tags                              = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              + "104.45.207.225",
              + "13.86.22.126",
                # (1 unchanged element hidden)
            ]
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_virtual_network.default[0] has changed
  ~ resource "azurerm_virtual_network" "default" {
      ~ address_space           = [
          - "172.173.0.0/12",
          + "172.0.0.0/12",
        ]
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default"
        name                    = "find-a-tp-pr-353-default"
        tags                    = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-353applogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-353httplogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault.default will be updated in-place
  ~ resource "azurerm_key_vault" "default" {
        id                              = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-353-kv"
        name                            = "find-a-tp-pr-353-kv"
        tags                            = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (13 unchanged attributes hidden)

      ~ network_acls {
          ~ default_action             = "Allow" -> "Deny"
          ~ ip_rules                   = [
              + "104.45.7.144",
            ]
          ~ virtual_network_subnet_ids = [
              + "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default/subnets/find-a-tp-pr-353keyvault",
            ]
            # (1 unchanged attribute hidden)
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.blobstorageclientsecret will be updated in-place
  ~ resource "azurerm_key_vault_secret" "blobstorageclientsecret" {
      ~ expiration_date         = "2028-07-14T18:10:52Z" -> (known after apply)
        id                      = "https://find-a-tp-pr-353-kv.vault.azure.net/secrets/BlobStorage--ClientSecret/7d8966f41364444b8fcfe16fac82a8ee"
        name                    = "BlobStorage--ClientSecret"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.fatpdbconnectionstring will be updated in-place
  ~ resource "azurerm_key_vault_secret" "fatpdbconnectionstring" {
      ~ expiration_date         = "2028-07-14T18:10:52Z" -> (known after apply)
        id                      = "https://find-a-tp-pr-353-kv.vault.azure.net/secrets/ConnectionStrings--FatpDatabase/1945d950f4a54148a137bfc9215ca7f1"
        name                    = "ConnectionStrings--FatpDatabase"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.fatpredisconnectionstring will be updated in-place
  ~ resource "azurerm_key_vault_secret" "fatpredisconnectionstring" {
      ~ expiration_date         = "2028-07-14T18:10:52Z" -> (known after apply)
        id                      = "https://find-a-tp-pr-353-kv.vault.azure.net/secrets/ConnectionStrings--FatpRedis/f15b6509c880472e9add4ba930c5d68d"
        name                    = "ConnectionStrings--FatpRedis"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.govuknotifyapikey will be updated in-place
  ~ resource "azurerm_key_vault_secret" "govuknotifyapikey" {
      ~ expiration_date         = "2028-07-14T18:10:52Z" -> (known after apply)
        id                      = "https://find-a-tp-pr-353-kv.vault.azure.net/secrets/GovUkNotify--ApiKey/955bc902172d442ba5261803baf58762"
        name                    = "GovUkNotify--ApiKey"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] will be updated in-place
  ~ resource "azurerm_linux_web_app" "default" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Web/sites/find-a-tp-pr-353"
        name                              = "find-a-tp-pr-353"
        tags                              = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (19 unchanged attributes hidden)

      ~ logs {
            # (2 unchanged attributes hidden)

          ~ application_logs {
                # (1 unchanged attribute hidden)

              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (2 unchanged attributes hidden)
                }
            }

          ~ http_logs {
              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.container_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "container_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Storage/storageAccounts/findatppr353logs|find-a-tp-pr-353-storage-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-353-storage-diag"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be updated in-place
  ~ resource "azurerm_resource_group" "default" {
        id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353"
        name     = "s177d01-ntp-pr-353"
      ~ tags     = {
          ~ "Environment"      = "Dev" -> "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account_network_rules.logs[0] will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "logs" {
        id                         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Storage/storageAccounts/findatppr353logs"
      ~ ip_rules                   = [
          - "104.45.207.225",
          - "13.66.10.127",
          - "13.86.22.126",
        ]
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet.keyvault_subnet will be updated in-place
  ~ resource "azurerm_subnet" "keyvault_subnet" {
      ~ address_prefixes                               = [
          - "172.0.8.0/23",
          + "172.174.8.0/23",
        ]
        id                                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default/subnets/find-a-tp-pr-353keyvault"
        name                                           = "find-a-tp-pr-353keyvault"
        # (8 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet.web_app_service_infra_subnet[0] will be updated in-place
  ~ resource "azurerm_subnet" "web_app_service_infra_subnet" {
      ~ address_prefixes                               = [
          - "172.0.0.0/23",
          + "172.174.0.0/23",
        ]
        id                                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default/subnets/find-a-tp-pr-353-webappserviceinfra"
        name                                           = "find-a-tp-pr-353-webappserviceinfra"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_virtual_network.default[0] will be updated in-place
  ~ resource "azurerm_virtual_network" "default" {
      ~ address_space           = [
          - "172.0.0.0/12",
          + "172.174.0.0/16",
        ]
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default"
        name                    = "find-a-tp-pr-353-default"
        tags                    = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 12 to change, 0 to destroy.
```
</details>